{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering",
      "department": "Computer Engineering",
      "duration": "2018-2024",
      "school_name": "McMaster University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_JaskaranDhillon",
  "highlighted_projects": [
    {
      "description": "Led a capstone team in the development of an application designed to streamline note-taking processes, allowing students to generate comprehensive PDF summaries of lecture notes and audio recordings. Developed a Python script which utilizes Prompt Engineering and OpenAI to provide summaries, definitions, and practice questions based on input content.",
      "git_url": "https://github.com/Jaskaran-Dhillon/StudyAI-Client",
      "name": "StudyAI"
    },
    {
      "description": "Developed a live chat application integrated with the Azure Translator API to allow users to communicate with each other, irrespective of their language. Designed an elegant and responsive user interface in React using Material-UI. Wrote unit tests for the front-end using Jest and React Testing Library. Built microservices using Express.js, PostgreSQL, and WebSockets to handle user authentication and communication.",
      "git_url": "https://github.com/Jaskaran-Dhillon/CommonTongue-Front-End",
      "name": "CommonTongue"
    },
    {
      "description": "Worked in a team to develop an application for Hack The 6ix that helps users learn financial literacy in a fun and engaging way. Implemented multiple game module interfaces for the front-end using React and Material-UI. Designed the back-end API using Express.js and populated the database with module questions and answers.",
      "git_url": "https://github.com/Jaskaran-Dhillon/PiggyBank-Front-End",
      "name": "PiggyBank"
    },
    {
      "description": "Developed a React application with a team for HackTheNorth which analyzes the user's posture and provides real-time corrective feedback using visual and audio notifications. Trained and implemented the Azure Custom Vision API to analyze images of the user's posture with 97% precision.",
      "git_url": "https://github.com/Jaskaran-Dhillon/PostureML",
      "name": "PostureML"
    }
  ],
  "jarvis_projects": [
    {
      "description": "The Linux Cluster Monitoring Agent (LCM) is a set of bash scripts that provide the functionality to monitor and log resource usage of every node in a cluster. The agent collects hardware information on every node and also collects data on CPU, memory, and disk usage for every node every minute. The data is stored in a PostgreSQL database provisioned using Docker. The LCM is an invaluable tool which provides Linux cluster usage data which can be accessed by an LCA team to assess system performance and plan for future resource allocation.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: A Java application that allows users to execute stock trades via the terminal, tracking both the latest stock information and purchases made by the user. The app fetches real-time stock data from the Alpha Vantage API and stores it in a Postgres database, allowing users to calculate profits and sell at a later date.",
        "Grep App: A Java implementation of the Linux grep command. It accepts a regex pattern, directory path, an out file path, and recursively searches through all files in the given directory to find all lines that match the given regex pattern. The lines are stored in the out file specified."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "A trading platform that allows users to create traders, accounts, and execute security orders through the EODHD API. Built as a REST API using Spring Boot, PostgreSQL, and Docker. This application provides a valuable platform for novice investors to begin trading stocks and learn more about the stock market.",
      "git_url": "/springboot",
      "name": "Springboot App"
    }
  ],
  "name": "Jaskaran Dhillon",
  "others": [
    {
      "bullets": [
        "Interested in 3D animations as a hobby, developing small projects in my free time.",
        "Hackathon enthusiast, participated in HTN 2021, Hack The 6IX 2023, and UOttaHack 4."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Canada Life",
      "description": "Built microservices using Spring Boot, MongoDB, and Kafka to facilitate a policy payment service, providing a reference implementation to showcase best practices and streamline the developer onboarding process. \\ Integrated the Azure Search OpenAI application with Canada Life for internal use and improved functionality with additional features using React and Flask.  Revamped outdated developer documentation, identifying gaps and consolidating resources to enhance the developer experience.  Created Spring Boot APIs showcasing various Kafka error handling patterns to standardize designs across teams.\n",
      "duration": "May 2023 - August 2023",
      "title": "Software Engineer Intern"
    },
    {
      "company": "Sera4",
      "description": "Developed Teleporte, a digital access control portal for smart locks, using React and TypeScript to implement major features and significantly enhance the user experience for 10,000+ enterprise users. Revamped internal tools for the support team by developing wizards to consolidate systems for managing customer organizations, assets, and licenses, streamlining processes and reducing task completion time by up to 30%. Wrote automated unit and integration tests for components with 90%+ code coverage using Jest and React Testing Library. Designed and presented Figma UI mockups to stakeholders, ensuring design alignment and minimizing revisions. Extended existing RESTful API microservices with new features using Express.js and PostgreSQL.\n",
      "duration": "May 2021 - August 2022",
      "title": "Software Engineer Intern"
    }
  ],
  "skills": {
    "competent": [
      "Linux",
      "JUnit",
      "Mockito",
      "TypeScript",
      "Jest",
      "Git",
      "Kubernetes",
      "PostgreSQL"
    ],
    "familiar": [
      "Figma",
      "MongoDB",
      "Python",
      "Kafka",
      "CI/CD"
    ],
    "proficient": [
      "Java",
      "JavaScript",
      "HTML/CSS",
      "React",
      "Spring Boot",
      "ExpressJS",
      "Agile/Scrum",
      "Docker"
    ]
  },
  "summary": "A recent Computer Engineering graduate from McMaster University with a  passion for software development. Experienced in full-stack development, having worked for 1.7 years in internships.  I have worked on high-impact projects such as architecting and developing a digital access control portal for Sera4 to help organizations manage their employees and access to their assets, using technologies such as React, ExpressJS, and PostgreSQL.  I have also worked as part of the Enterprise Architecture team at Canada Life to develop POC applications to serve as reference implementations and enhance the developer experience.  Being able to solve complex real-world problems drives me to keep improving my craft in this industry, always seeking the next greater challenge.\n"
}
